/*******************************华丽的分隔符*******************************/
//声明变量
//变量在脚本中的首次亮相是在其声明中。在变量首次出现时将会在内存中设置它，因此
//您稍后可在脚本中引用它。应在使用变量之前先声明变量。可以使用var关键字实现此目的
var count;
//如果未在var语句中初始化您的变量，它将自动采用undefine值。
/*******************************华丽的分隔符*******************************/
//命名空间
//JavaScript是一种区分大小写的语言。
//@TODO 如果你需要声明并初始化一个变量，但不需要为变量指定任何特定值时，请为变量分配null值
var bestAge = null;
//@TODO 如果声明一个变量而不为其赋值，则该变量具有undefine值。
var currentCount;
//null值的行为与数字0相似，而undefined的行为与特定值NaN类似。
//如果您比较一个null值和undefined值，则它们相等
/*******************************华丽的分隔符*******************************/
//强制转换
//如果添加一个数字和字符串，则该数字会强制转换为字符串
//如果添加一个布尔值和字符串，则该布尔值会强制转换为字符串
//如果添加一个数字和布尔值，则该布尔值会强制转换为数字
