/*******************************华丽的分隔符*******************************/
//运算符
//①：算符运算符
//描述            符号
//一元求反        -
//递增            ++
//递减            --
//乘法            *
//除法            /
//取模算法        %
//添加            +
//减法            -

//②：逻辑运算符
//描述            符号
//逻辑“非”       !
//小于            <
//大于            >
//小于或等于      <=
//大于或等于      >=
//相等            ==
//不相等          !==
//逻辑“与”      &&
//逻辑“或”      ||
//有条件的（三元） ?:
//逗号            ,
//严格相等          ===
//严格不等          !==


//特殊数据类型
//①：Null
//②：未定义 undefined

/*******************************华丽的分隔符*******************************/
//null数据类型
//null数据类型在JavaScript中仅具有一个值：null。null关键字不能用作函数或变量的名称
//通过为变量赋null值可以清除变量的内容（不删除变量）
//@TODO ①：null与0不同，②：typeof运算符将null值报告为Object类型

//undefined数据类型
//如果使用的对象的属性不存在，或使用的是已经声明但未赋值的变量，undefined值将被返回
//可以通过将变量与undefined进行比较确认变量是否存在
//通过将变量的类型与字符串"undefined"进行比较确认其类型是否为undefined